app/views/users/_form.html.erb

    <td align="right" ><%= f.label t('.role') %></td>
    <td><%= collection_select :user, :role_id, Role.find(:all), :id, :name %></td>
---
SELECT 1 FROM "users" WHERE ("users"."name" = 'MyString' AND "users"."id" != 980190962) LIMIT 1