app/controllers/users_controller.rb

  def index

    @users = User.order(sort_column + ' ' + sort_direction)
---
SELECT "users".* FROM "users" ORDER BY name

  def destroy
    @user = User.find(params[:id])
   # @user.destroy

    @credentials = Credential.find_by_user_id(@user.id)
    #logger.debug "USER: #{@user.inspect}"
    #logger.debug "CREDENITALS: #{@credentials.inspect}"
    respond_to do |format|
      if @credentials == nil
        @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]